# Assignment 16

In [ ]:
import pandas as pd

In [133]:
# from IPython.core.display import HTML
# css = open('style-table.css').read() + open('style-notebook.css').read()
# HTML('<style>{}</style>'.format(css))

In [4]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [5]:
titles["title"].count()

244914

### What are the earliest two films listed in the titles dataframe?

In [6]:
df=titles.sort_values(by=['year'])
df[:2]
#titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [7]:
df2=titles[titles['title']=="Hamlet"].sort_values('year')
print("There are total ",df2["title"].count() ,"movies have the title Hamlet")
df2
#len(titles[titles.title == 'Hamlet'])

There are total  20 movies have the title Hamlet

         title  year
52521   Hamlet  1910
198234  Hamlet  1911
39916   Hamlet  1913
10637   Hamlet  1921
101728  Hamlet  1948
172640  Hamlet  1954
161324  Hamlet  1964
67406   Hamlet  1969
122827  Hamlet  1973
133921  Hamlet  1976
82130   Hamlet  1987
192142  Hamlet  1990
178222  Hamlet  1996
62000   Hamlet  2000
189093  Hamlet  2009
173033  Hamlet  2011
202025  Hamlet  2014
154029  Hamlet  2015
88065   Hamlet  2016
6422    Hamlet  2017

### How many movies are titled "North by Northwest"?

In [8]:
df2=titles[titles['title']=="North by Northwest"]
#df2["title"].count()
print("There is only ",df2["title"].count() ,"movie that have the title North by Northwest")
df2

There is only  1 movie that have the title North by Northwest

                    title  year
74398  North by Northwest  1959

### When was the first movie titled "Hamlet" made?

In [9]:
df3=df[df['title'].str.contains("Hamlet")] 
df3.head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [10]:
df4=df[df['title']=="Treasure Island"] 
print(df4["title"].count())
df4

8

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [11]:

#df2 = titles[(titles['title'].str.contains('F')) & (titles['year'] == 1950)]
df5 = titles[(titles['year'] == 1950)]
print(df5['title'].count(), " movies were made in the year 1950")
df5

1113  movies were made in the year 1950

                          title  year
189          La soif des hommes  1950
268            Sohrab at Rustum  1950
308                       Gemma  1950
314                Rasuna valea  1950
524          Trial Without Jury  1950
...                         ...   ...
244200               Inmaculada  1950
244362        Golden Salamander  1950
244440  Prisoners in Petticoats  1950
244470  The Golden Gloves Story  1950
244820                 Doctor X  1950

[1113 rows x 2 columns]

### How many movies were made in the year 1960?

In [12]:
df6 = titles[(titles['year'] == 1960)]
print(df6['title'].count(), " movies were made in the year 1960")
df6

1549  movies were made in the year 1960

                                   title  year
52                   Tayna Dimki Karmiya  1960
88                 Tres angelitos negros  1960
226                         Viuda de oro  1960
227                      Tao se feng yun  1960
590                 Mahallenin sevgilisi  1960
...                                  ...   ...
244366                  Trouble with Eve  1960
244555  Makrykostaioi kai Kondogiorgides  1960
244774                        Tall Story  1960
244781                         Telegrame  1960
244819                   Me importa poco  1960

[1549 rows x 2 columns]

### How many movies were made from 1950 through 1959?

In [13]:
df7 = titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)].sort_values(by=['year'])
print(df7['title'].count(), " movies were made between years 1950 & 1959")
df7

12934  movies were made between years 1950 & 1959

                            title  year
84160             Colorado Ranger  1950
47519            Maalesh ya zahar  1950
18855                Smelye lyudi  1950
235960      Streets of Ghost Town  1950
133183               Your Witness  1950
...                           ...   ...
220692                   The Trap  1959
190665  Third Man on the Mountain  1959
123470                       Kruh  1959
126748    Mis padres se divorcian  1959
187180           Kibris sehitleri  1959

[12934 rows x 2 columns]

### In what years has a movie titled "Batman" been released?

In [14]:
df8= titles[titles["title"]=='Batman'].sort_values(by=['year'])
df8

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [15]:
cast = pd.read_csv('cast.csv')
cast.head()

c1=cast[cast["title"]=="Inception"]
c1["character"].count()

print(f"There were {c1['character'].count()} roles in movie 'Inception'")

There were 78 roles in movie 'Inception'

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [16]:
c2= c1['n'].isna().sum()
#c2
print(f"In the movie 'Inception' there are {c2} values which are  NOT ranked by an 'n' value?")

In the movie 'Inception' there are 27 values which are  NOT ranked by an 'n' value?

### But how many roles in the movie "Inception" did receive an "n" value?

In [17]:
c3= c1['n'].notna().sum()
#c2
print(f"In the movie 'Inception' there are {c3} values which did recieve an 'n' value?")

In the movie 'Inception' there are 51 values which did recieve an 'n' value?

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:
c4=cast[cast["title"]=="North by Northwest"]
c5=c4.sort_values('n').dropna()
c5['name']

871426               Cary Grant
3518333         Eva Marie Saint
1457165             James Mason
3157232     Jessie Royce Landis
356707           Leo G. Carroll
3048272    Josephine Hutchinson
1695173             Philip Ober
1275337           Martin Landau
2447081           Adam Williams
1811387            Edward Platt
665768        Robert Ellenstein
2295714            Les Tremayne
464736          Philip Coolidge
1508344           Patrick McVey
206471             Edward Binns
1384780               Ken Lynch
Name: name, dtype: object

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [20]:
c6=cast[(cast["title"]=="Sleuth") & (cast['year']==1972)]
c6 =c6.sort_values('n')#.dropna()
c6["name"]

1705394      Laurence Olivier
326773          Michael Caine
373876         Alec Cawthorne
1465483    John (II) Matthews
2724553    Eve (III) Channing
1448690          Teddy Martin
Name: name, dtype: object

,title,year,name,type,character,n
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [21]:
c6=cast[(cast["title"]=="Sleuth") & (cast['year']==2007)]
c6 =c6.sort_values('n')#.dropna()
c6["name"]

326774           Michael Caine
1293634               Jude Law
1805907          Harold Pinter
260242         Kenneth Branagh
373877     Alec (II) Cawthorne
2724552      Eve (II) Channing
3370424      Carmel O'Sullivan
Name: name, dtype: object

### How many roles were credited in the silent 1921 version of Hamlet?

In [22]:
#release_dates = pd.read_csv("release_dates.csv")
#release_dates.head()
c6=cast[(cast['title']=='Hamlet') & (cast['year']==1921)]
c6["character"].count()

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [23]:
c6=cast[(cast['title']=='Hamlet') & (cast['year']==1996)]
print(c6['character'].count())

c6.head(15)

54

,title,year,name,type,character,n
1731,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0
95861,Hamlet,1996,Richard Attenborough,actor,English Ambassador,2.0
158642,Hamlet,1996,Simon Russell Beale,actor,Second Gravedigger,37.0
214473,Hamlet,1996,David (V) Blair,actor,Attendant to Claudius,3.0
219554,Hamlet,1996,Brian Blessed,actor,Ghost of Hamlet's Father,4.0
250773,Hamlet,1996,Christopher Bowles,actor,Cadet in Play,NaN
260225,Hamlet,1996,Kenneth Branagh,actor,Hamlet,5.0
272749,Hamlet,1996,Richard Briers,actor,Polonius,6.0
294652,Hamlet,1996,Michael Bryant,actor,Priest,7.0
319501,Hamlet,1996,Peter Bygott,actor,Attendant to Claudius,8.0
344365,Hamlet,1996,Kenneth W Caravan,actor,Laertes Mob,NaN
500916,Hamlet,1996,Billy Crystal,actor,First Gravedigger,10.0
518572,Hamlet,1996,Charles Daish,actor,Stage Manager,11.0
576147,Hamlet,1996,G?rard Depardieu,actor,Reynaldo,13.0
598618,Hamlet,1996,Reece Dinsdale,actor,Guildenstern,14.0

### How many "Hamlet" roles have been listed in all film credits through history?

In [30]:
c6=cast[(cast['title']=='Hamlet') & (cast['n'].notna())]
print(c6['character'].count())

c6.head()

249

        title  year              name   type              character     n
1731   Hamlet  1996        Riz Abbasi  actor  Attendant to Claudius   1.0
7789   Hamlet  1921  Fritz Achterberg  actor            Fortinbras,   9.0
11728  Hamlet  2009      Hayden Adams  actor                Laertes   7.0
11729  Hamlet  2009      Hayden Adams  actor                 Player   7.0
14493  Hamlet  1913       Eric Adeney  actor               Reynaldo  14.0

### How many people have played an "Ophelia"?

In [31]:
c6=cast[(cast['character']=='Ophelia')]
print(c6['character'].count())


c6.head()

117

,title,year,name,type,character,n
248251,The Merry Maids of Madness,2016,Amy Bourque,actor,Ophelia,11.0
410247,Jake Gets Paid,2009,Josie Chisholm,actor,Ophelia,NaN
470859,Inoperable,2017,Crystal Cordero,actor,Ophelia,NaN
866334,"Dogg's Hamlet, Cahoot's Macbeth",2005,Lucas Grabeel,actor,Ophelia,NaN
1364457,11,2014,Catherine (IV) Lord,actor,Ophelia,NaN

### How many people have played a role called "The Dude"?

In [32]:
c6=cast[(cast['character']=='The Dude')]
print(c6['character'].count())


c6.head()

19

                         title  year            name   type character     n
272161        The Big Lebowski  1998    Jeff Bridges  actor  The Dude   1.0
339389      Terms & Conditions  2015     Jordan Cann  actor  The Dude   9.0
498660                Stranger  2000   Scott Crowell  actor  The Dude   NaN
570128  Pizza Man vs. the Dude  2004  Chris DeMarcus  actor  The Dude   NaN
610791             Sweepstakes  1931     Mike Donlin  actor  The Dude  12.0

### How many people have played a role called "The Stranger"?

In [33]:
c6=cast[(cast['character']=='The Stranger')]
print(c6['character'].count())


c6.head()

212

,title,year,name,type,character,n
25954,Theeb,2014,Hassan Mutlag Al-Maraiyeh,actor,The Stranger,2.0
35748,My Time to Die,2014,Vincent H. Alexander,actor,The Stranger,2.0
46418,Hickok,2017,Terral Altom,actor,The Stranger,NaN
67421,Get Mean,1975,Tony Anthony,actor,The Stranger,1.0
67424,Lo straniero di silenzio,1968,Tony Anthony,actor,The Stranger,1.0

### How many roles has Sidney Poitier played throughout his career?

In [35]:
c6=cast[(cast['name']=='Sidney Poitier')]
print(c6['name'].count())


c6.head()

43

,title,year,name,type,character,n
1816209,A Patch of Blue,1965,Sidney Poitier,actor,Gordon Ralfe,1.0
1816210,A Piece of the Action,1977,Sidney Poitier,actor,Manny Durrell,1.0
1816211,A Raisin in the Sun,1961,Sidney Poitier,actor,Walter Lee Younger,1.0
1816212,A Warm December,1973,Sidney Poitier,actor,Dr. Matt Younger,1.0
1816213,All the Young Men,1960,Sidney Poitier,actor,Sgt. Eddie Towler,2.0

### How many roles has Judi Dench played?

In [36]:
c6=cast[(cast['name']=='Judi Dench')]
print(c6['name'].count())


c6.head()

55

,title,year,name,type,character,n
2814206,84 Charing Cross Road,1987,Judi Dench,actress,Nora Doel,3.0
2814207,A Handful of Dust,1988,Judi Dench,actress,Mrs. Beaver,13.0
2814208,A Midsummer Night's Dream,1968,Judi Dench,actress,Titania,16.0
2814209,A Room with a View,1985,Judi Dench,actress,"Eleanor Lavish, a novelist",7.0
2814210,A Study in Terror,1965,Judi Dench,actress,Sally,8.0

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [55]:
c6=cast[(cast['name']=='Cary Grant') & (cast['n']==2) & (cast['year']>=1940)& (cast['year']<1950)]
print(c6['name'].count())


c6.head().sort_values('year')

2

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [59]:
c6=cast[(cast['name']=='Cary Grant') & (cast['n']==1) & (cast['year']>=1940)& (cast['year']<1950)]
print(c6['name'].count())


c6.head().sort_values('year')

18

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [60]:
c6=cast[(cast['type']=='actor') & (cast['year']>=1950)& (cast['year']<1960)]
print(c6['name'].count())


c6.head().sort_values('year')

157738

,title,year,name,type,character,n
288,Palletoori Pilla,1950,Subba Rao A.V.,actor,Kampanna Dora,4.0
119,Die Todesarena,1953,Die 3 Motorellos,actor,Themselves,NaN
111,Ci sposeremo a Capri,1956,Quartetto 2+2,actor,Themselves,19.0
66,Fire Down Below,1957,'Stretch' Cox Troupe,actor,Limbo Dance by,20.0
68,Dorp aan de rivier,1958,Frans 't Hoen,actor,Dirk Jan,15.0

### How many roles were available for actresses in the 1950s?

In [62]:
c6=cast[(cast['type']=='actress') & (cast['year']>=1950)& (cast['year']<1960)]
print(c6['name'].count())


c6.head().sort_values('year')

57733

,title,year,name,type,character,n
2532684,A Woman of Distinction,1950,Lucienne & Ashour,actress,Apache Dancers,NaN
2532686,Chain Lightning,1950,Lucienne & Ashour,actress,Apache Dancers,NaN
2532731,Death of a Salesman,1951,Beverly Aadland,actress,Girl,NaN
2532693,De moedige bruidegom,1952,Hilda 't Seyen,actress,De moeder van Tinneke,NaN
2532730,Cuban Rebel Girls,1959,Beverly Aadland,actress,Beverly Woods,2.0

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [63]:
c6=cast[(cast['n']==1) &(cast['year']<=1980)]
print(c6['name'].count())


c6.head().sort_values('year')

65140

                      title  year         name   type           character    n
300            En glad gutt  1932   Hauk Aabel  actor       Ola Nordistua  1.0
305       En herre med bart  1942    Per Aabel  actor  Ole Grong, advokat  1.0
1087  Batman Fights Dracula  1967  Jing Abalos  actor              Batman  1.0
1088  Batman Fights Dracula  1967  Jing Abalos  actor         Bruce Wayne  1.0
1092            Mighty Rock  1969  Jing Abalos  actor         Mighty Rock  1.0

### How many non-leading roles were available through from the beginning of film history through 1980?

In [65]:
c6=cast[(cast['n']!=1) &(cast['year']<=1980)].dropna()
print(c6['name'].count())


c6.head().sort_values('year')

669320

,title,year,name,type,character,n
49,In the Land of the Head Hunters,1914,Paddy 'Malid,actor,Kenada,5.0
26,Los tarantos,1963,'El Guisa',actor,Bailaor,25.0
28,Los tarantos,1963,'El Viti',actor,Cantaor,20.0
37,That's the Way of the World,1975,Murray the 'K',actor,Big John Little,22.0
36,I Wanna Hold Your Hand,1978,Murray the 'K',actor,Himself,48.0

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [73]:
c6=cast[(cast['n'].isna()) &(cast['year']<=1980)]
print(c6['n'].isna().sum())


c6.head().sort_values('year')

448347

,title,year,name,type,character,n
119,Die Todesarena,1953,Die 3 Motorellos,actor,Themselves,NaN
116,Thunder in Carolina,1960,2nd Marine Division Band,actor,Themselves,NaN
113,Atemlos vor Liebe,1970,Ballett 2000,actor,Themselves,NaN
35,Been Down So Long It Looks Like Up to Me,1971,Murray the 'K',actor,Himself,NaN
20,Natas es Satan,1977,Ramon 'Cartucho' Pena,actor,Nigth Club Owner,NaN